# Склонение слова
# Реализовать склонение слова «процент» во фразе «N процентов». Вывести эту фразу на экран отдельной строкой для
# каждого из чисел в интервале от 1 до 100:
# 1 процент
# 2 процента
# 3 процента
# 4 процента
# 5 процентов
# 6 процентов
# ...
# 100 процентов


numb = 0
ov = 'Процентов'
ta = 'Процента'
nt = 'Процент'


while numb <= 99:
    numb += 1
    numb_1 = numb % 10

    if numb == 11:
        print(numb, ov)

    elif numb_1 == 1:
        print(numb, nt)

    elif numb_1 >= 5 and numb_1 <= 9 or numb_1 == 0 or (numb >= 11 and numb <= 19):
        print(numb, ov)

    elif numb_1 >= 2 and numb_1 <= 4:
        print(numb, ta)